tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'neovim/neovim'
tap 'telemachus/desc'
tap 'xu-cheng/mine'
tap 'youtux/livecheck'
brew 'archey'
brew 'arpack'
brew 'astyle'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'binutils'
brew 'bison'
brew 'boost'
brew 'boot2docker'
brew 'brew-cask'
brew 'cheat'
brew 'ckan'
brew 'cloog'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'direnv'
brew 'dnscrypt-proxy'
brew 'docker'
brew 'doxygen'
brew 'epstool'
brew 'faac'
brew 'ffmpeg'
brew 'fftw'
brew 'findutils'
brew 'flex'
brew 'flint'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'geoip'
brew 'geos'
brew 'gettext'
brew 'ghostscript'
brew 'gistit'
brew 'git'
brew 'git-flow'
brew 'gl2ps'
brew 'glpk'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnuplot', args: ['with-qt']
brew 'gnutls'
brew 'graphicsmagick'
brew 'graphviz'
brew 'hdf5'
brew 'htop-osx'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'jansson'
brew 'jbig2dec'
brew 'jpeg'
brew 'jq'
brew 'keybase'
brew 'lame'
brew 'less'
brew 'libevent'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libxml2'
brew 'libyaml'
brew 'little-cms'
brew 'little-cms2'
brew 'llvm', args: ['with-python', 'with-lldb', 'with-clang']
brew 'lua'
brew 'luajit'
brew 'makedepend'
brew 'matplotlib', args: ['with-python3', 'with-pyqt', 'with-tex', 'with-ghostscript', 'with-pyside']
brew 'matplotlib-basemap', args: ['with-python3']
brew 'mercurial'
brew 'mpfr'
brew 'mupdf-tools'
brew 'neovim', args: ['HEAD']
brew 'nettle'
brew 'node'
brew 'numpy', args: ['with-python3']
brew 'octave'
brew 'openssl'
brew 'p11-kit'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pbc'
brew 'pcre'
brew 'pillow', args: ['with-python3']
brew 'pkg-config'
brew 'plotutils'
brew 'pstoedit'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pyenv-which-ext'
brew 'pyqt', args: ['with-python3']
brew 'pyside', args: ['with-python3']
brew 'python'
brew 'python3'
brew 'qhull'
brew 'qrupdate'
brew 'qscintilla2'
brew 'qt'
brew 'quilt'
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'readline'
brew 'rethinkdb'
brew 'rtmpdump'
brew 'ruby'
brew 'ruby-build'
brew 'safe-rm'
brew 'scipy', args: ['with-python3']
brew 'shellcheck'
brew 'shiboken', args: ['with-python3']
brew 'sip', args: ['with-python3']
brew 'sqlite'
brew 'ssh-copy-id'
brew 'ssldump'
brew 'subversion'
brew 'suite-sparse'
brew 'swig'
brew 'szip'
brew 'tbb'
brew 'tcping'
brew 'terminal-notifier'
brew 'texi2html'
brew 'texinfo'
brew 'tmux'
brew 'tor'
brew 'tree'
brew 'unrar'
brew 'veclibfort'
brew 'webp'
brew 'wget'
brew 'with-readline'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zeromq'
brew 'zsh-syntax-highlighting'
cask 'betterzipql'
cask 'gpgtools'
cask 'java'
cask 'mono-mre'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skim'
cask 'suspicious-package'
cask 'virtualbox'
cask 'webpquicklook'
