tap 'bfontaine/aliases'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'neovim/neovim'
tap 'youtux/livecheck'
cask 'java'
brew 'archey'
brew 'astyle'
brew 'autoconf'
brew 'autojump'
brew 'xz'
brew 'automake'
brew 'binutils'
brew 'bison'
brew 'boost'
brew 'pcre'
brew 'gettext'
brew 'git'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'cheat'
brew 'cmake'
brew 'libiomp'
brew 'clang-omp'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'libsodium'
brew 'dnscrypt-proxy'
brew 'pkg-config'
brew 'libpng'
brew 'freetype'
brew 'graphviz'
brew 'doxygen'
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
brew 'fontconfig'
brew 'little-cms2'
brew 'jbig2dec'
brew 'ghostscript'
brew 'webp'
brew 'imagemagick'
brew 'emacs', args: ['with-cocoa']
brew 'texi2html'
brew 'readline'
brew 'sqlite'
brew 'gdbm'
brew 'makedepend'
brew 'openssl'
brew 'python'
brew 'yasm'
brew 'x264'
brew 'lame'
brew 'libvo-aacenc'
brew 'xvid'
brew 'ffmpeg'
brew 'findutils'
brew 'gawk'
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'gd'
brew 'ghc'
brew 'jansson'
brew 'gistit'
brew 'git-flow'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'libyaml'
brew 'ruby'
brew 'heroku-toolbelt'
brew 'htop-osx'
brew 'hub'
brew 'icdiff'
brew 'jq'
brew 'node'
brew 'keybase'
brew 'libevent'
brew 'llvm', args: ['with-python', 'with-lldb', 'with-clang']
brew 'lua'
brew 'mercurial'
brew 'mupdf-tools'
brew 'ngrok'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pbc'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pyenv-which-ext'
brew 'qt'
brew 'python3'
brew 'sip', args: ['with-python3']
brew 'pyqt', args: ['with-python3']
brew 'shiboken', args: ['with-python3']
brew 'pyside', args: ['with-python3']
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'safe-rm'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'subversion'
brew 'swig'
brew 'tcping'
brew 'terminal-notifier'
brew 'tmux'
brew 'tor'
brew 'tree'
brew 'unrar'
brew 'v'
brew 'wget'
brew 'with-readline'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zsh-syntax-highlighting'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/less'
brew 'homebrew/games/ckan'
brew 'homebrew/python/numpy', args: ['with-python3']
brew 'homebrew/python/matplotlib', args: ['with-python3', 'with-pyqt', 'with-tex', 'with-ghostscript', 'with-pyside']
brew 'homebrew/python/pillow', args: ['with-python3']
brew 'homebrew/python/scipy', args: ['with-python3']
brew 'homebrew/science/flint'
brew 'neovim/neovim/neovim', args: ['HEAD']
cask 'betterzipql'
cask 'font-fontawesome'
cask 'gpgtools'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skim'
cask 'suspicious-package'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'webpquicklook'
