tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/aliases'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'neovim/neovim'
cask 'java'
cask 'mactex'
brew 'archey'
brew 'xz'
brew 'pkg-config'
brew 'aria2'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'binutils'
brew 'bison'
brew 'icu4c'
brew 'boost'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'cairo'
brew 'cheat'
brew 'sphinx-doc'
brew 'cmake'
brew 'readline'
brew 'sqlite'
brew 'makedepend'
brew 'openssl'
brew 'gdbm'
brew 'python'
brew 'subversion'
brew 'clang-format'
brew 'gmp'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'libsodium'
brew 'minisign'
brew 'dnscrypt-proxy'
brew 'graphviz'
brew 'qt5'
brew 'llvm', args: ['with-lldb', 'with-python']
brew 'doxygen'
brew 'enca'
brew 'texi2html'
brew 'yasm'
brew 'git'
brew 'x264'
brew 'lame'
brew 'xvid'
brew 'fribidi'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'libass'
brew 'jpeg'
brew 'libtiff'
brew 'webp'
brew 'ffmpeg'
brew 'findutils'
brew 'fpp'
brew 'fzf'
brew 'mpfr'
brew 'gawk'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'little-cms2'
brew 'ghostscript'
brew 'jansson'
brew 'gistit'
brew 'gnu-getopt'
brew 'git-flow-avh'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'libyaml'
brew 'ruby'
brew 'heroku'
brew 'lua'
brew 'highlight'
brew 'homebrew/dupes/ncurses'
brew 'htop', args: ['with-ncurses']
brew 'hub'
brew 'icdiff'
brew 'libtool'
brew 'imagemagick'
brew 'oniguruma'
brew 'jq'
brew 'keybase'
brew 'libevent'
brew 'mercurial'
brew 'mitmproxy'
brew 'mono'
brew 'youtube-dl'
brew 'python3'
brew 'mpv', args: ['with-bundle']
brew 'mupdf-tools'
brew 'node'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pbc'
brew 'plantuml'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pyenv-which-ext'
brew 'sip', args: ['with-python3']
brew 'pyqt5', args: ['with-python']
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'safe-rm'
brew 'shellcheck'
brew 'socat'
brew 'ssh-copy-id'
brew 'swig'
brew 'tcping'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux', args: ['HEAD']
brew 'tor'
brew 'tree'
brew 'unrar'
brew 'valgrind'
brew 'wget'
brew 'with-readline'
brew 'yuicompressor'
brew 'zsh-syntax-highlighting'
brew 'homebrew/dupes/less'
brew 'homebrew/games/ckan'
brew 'homebrew/python/numpy', args: ['with-python3']
brew 'homebrew/python/matplotlib', args: ['with-ghostscript', 'with-pyqt5', 'with-python3', 'with-tex']
brew 'homebrew/python/pillow', args: ['with-python3']
brew 'homebrew/python/scipy', args: ['with-python3']
brew 'homebrew/science/flint'
brew 'neovim/neovim/neovim', args: ['HEAD', 'with-release']
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'betterzipql'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'font-fontawesome'
cask 'gfxcardstatus'
cask 'grammarly'
cask 'ipe'
cask 'istat-menus'
cask 'jump-desktop'
cask 'logitech-options'
cask 'mcedit'
cask 'near-lock'
cask 'numi'
cask 'osxfuse'
cask 'papers'
cask 'postman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlrest'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skim'
cask 'skype'
cask 'terminology'
cask 'transmission'
cask 'tunnelblick'
cask 'typora'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'vmware-fusion'
cask 'wallpaper-wizard'
cask 'webpquicklook'
